apps/1-2k/1718/0.6/introscope_ta/default/inputs.conf

[introscope]
soapTemplate = <soapenv:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:met="http://metricsdata.webservicesimpl.server.introscope.wily.com">   <soapenv:Header/>   <soapenv:Body>      <met:getMetricData soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">         <agentRegex xsi:type="xsd:string">$agentRegex</agentRegex>         <metricRegex xsi:type="xsd:string">$metricRegex</metricRegex>         <startTime xsi:type="xsd:dateTime">$startTime</startTime>         <endTime xsi:type="xsd:dateTime">$endTime</endTime>         <dataFrequency xsi:type="xsd:int">$dataFrequency</dataFrequency>      </met:getMetricData>   </soapenv:Body></soapenv:Envelope>
offset = 2
polling_interval = 5
dataFrequency = 60
introscope_path = /introscope-web-services/services/MetricsDataService
sourcetype = introscope